# Pandas -  Filtering missing data NAN

### filtering in series data set

In [6]:
import pandas as pd
import numpy as np

In [9]:
s = pd.Series([np.NAN,4,5,np.NAN,7,np.NAN,np.NAN,2,6,7,np.NAN])

In [11]:
s

0     NaN
1     4.0
2     5.0
3     NaN
4     7.0
5     NaN
6     NaN
7     2.0
8     6.0
9     7.0
10    NaN
dtype: float64

In [12]:
s.dropna()

1    4.0
2    5.0
4    7.0
7    2.0
8    6.0
9    7.0
dtype: float64

### filtering in dataframe

In [21]:
df = pd.DataFrame([[1,5,8],[np.NAN,np.NAN,np.NAN],[np.NAN,34,76]])

In [22]:
df

     0     1     2
0  1.0   5.0   8.0
1  NaN   NaN   NaN
2  NaN  34.0  76.0

In [26]:
df.dropna() # remove rows with any instance of NAN

     0    1    2
0  1.0  5.0  8.0

In [25]:
df.dropna(how='all') # remove only rows with all NAN values

     0     1     2
0  1.0   5.0   8.0
2  NaN  34.0  76.0

### column level

In [28]:
df.dropna(axis=1) # remove columns with any instance of NAN

Empty DataFrame
Columns: []
Index: [0, 1, 2]

In [30]:
df.dropna(axis=1,how='all') # remove only columns with all NAN values

     0     1     2
0  1.0   5.0   8.0
1  NaN   NaN   NaN
2  NaN  34.0  76.0

### Filter based on threshold

In [34]:
df.dropna(thresh=1) # remove rows which dont have atleast 1 integer value

     0     1     2
0  1.0   5.0   8.0
2  NaN  34.0  76.0

In [36]:
df.dropna(thresh=2) # remove rows which dont have atleast 2 integer value

     0     1     2
0  1.0   5.0   8.0
2  NaN  34.0  76.0

In [37]:
df.dropna(thresh=3) # remove rows which dont have atleast 3 integer value

     0    1    2
0  1.0  5.0  8.0

In [40]:
df.dropna(axis=1,thresh=2)

      1     2
0   5.0   8.0
1   NaN   NaN
2  34.0  76.0